Revit 2027 API
Metal.MetalPerforationsShader Property
 The property labeled "Image" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetalPerforationsShader { get; }
Public Shared ReadOnly Property MetalPerforationsShader As String
	Get
public:
static property String^ MetalPerforationsShader {
	String^ get ();
}
static member MetalPerforationsShader : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
Metal Class
Autodesk.Revit.DB.Visual Namespace